{
  "backend/main.mo": "Main Motoko actor for the AnthroVerse backend, defining all core data types (User, Post, Event, Notification, etc.) and integrating authorization, blob storage, and user approval mixins. Contains state maps for users, posts, comments, events, tenures, notifications, and event registrations.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to the specific frontend files, component dependencies, and test IDs they address, primarily focused on fixing blank-page issues, adding error boundaries, and auditing TanStack Router/React Query initialization.",
  "frontend-file-summaries.txt": "A JSON-formatted reference document summarizing the purpose and key changes of each frontend source file, serving as a build/audit guide for component signatures, permission utilities, and hook updates.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom properties for the design system's light and dark color themes, including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the AnthroVerse frontend SPA, mounting the React app into a root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all app routes (feed, events, admin, chapter-growth, profile), manages authentication and loading phases via Internet Identity, and conditionally renders login, profile setup, waiting-for-approval, or the main layout.",
  "frontend/src/components/admin/RoleAssignmentPanel.tsx": "Admin panel that lists users by approval status (pending/approved/rejected) and allows approving, rejecting, or assigning roles to each user.",
  "frontend/src/components/admin/TenureManagement.tsx": "Admin component for starting a new organizational tenure, allowing selection of President, Vice President, and Secretary-Treasurer from approved users with a two-step confirmation dialog that warns about role resets.",
  "frontend/src/components/AppHeader.tsx": "Sticky app header component featuring a sidebar toggle, notification bell with unread badge, and a dropdown listing recent notifications with type labels and relative timestamps, marking them read on open.",
  "frontend/src/components/AppSidebar.tsx": "Renders the application sidebar with navigation links, user profile info, role badge, and logout button, using role-based logic to show admin-only items.",
  "frontend/src/components/auth/AuthLayout.tsx": "Wrapper layout component for authentication pages that renders a full-screen background image with overlay, a centered logo, and a glassmorphism card containing child content.",
  "frontend/src/components/auth/LoginForm.tsx": "Login form component that triggers Internet Identity passwordless authentication and provides a link to switch to the signup flow.",
  "frontend/src/components/auth/SignupForm.tsx": "Multi-step signup form that first connects via Internet Identity, then collects name, email, and optional profile picture to create a new member profile.",
  "frontend/src/components/auth/WaitingForApproval.tsx": "Full-screen holding page shown to users whose accounts are pending admin approval, with options to send an approval request notification or sign out.",
  "frontend/src/components/chapter-growth/GroupFeed.tsx": "Displays a filtered post feed for a specific PostCategory group, with a toggle to show a post creation form and loading skeletons while fetching.",
  "frontend/src/components/ErrorBoundary.tsx": "React class component that catches rendering errors and displays a fallback UI with an error message and a page-refresh button.",
  "frontend/src/components/events/CreateEventForm.tsx": "Form component for creating a new event with fields for title, description, date/time, optional banner image upload, and an optional registration limit.",
  "frontend/src/components/events/EventCard.tsx": "Displays a single event card with banner, date, registration limit, and a register button that calls the registration mutation and shows toast feedback.",
  "frontend/src/components/feed/CreatePostForm.tsx": "Form component for creating a new post with text content, category selection (filtered by user role), and optional image upload.",
  "frontend/src/components/feed/PendingApprovals.tsx": "Lists all pending posts fetched from the backend and provides an approve button for each, intended for moderator use.",
  "frontend/src/components/feed/PostCard.tsx": "Renders a single post with like/delete/approve actions, collapsible comments section, and category badge styling based on post type.",
  "frontend/src/components/feed/PostFilters.tsx": "UI component providing category tab filters, a 'My Posts' toggle, and a search input for filtering the post feed.",
  "frontend/src/components/layout/MainLayout.tsx": "Main app shell with a sticky header, role-based navigation links, user profile link, and logout functionality.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple animated spinner component with configurable size (sm/md/lg) using Tailwind CSS.",
  "frontend/src/components/notifications/NotificationBell.tsx": "Bell icon button showing an unread count badge that opens a popover with the notification panel and marks notifications as read on open.",
  "frontend/src/components/notifications/NotificationItem.tsx": "Renders a single notification row with a type-specific icon, message text, relative timestamp, and an unread indicator dot.",
  "frontend/src/components/notifications/NotificationPanel.tsx": "Renders a sorted list of notifications in a scrollable panel, or an empty state with a bell icon if there are none.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with like, comment, approve, and delete actions, gating controls by user role and authorship.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form that collects a new user's name and email on first login and saves the profile via the backend actor.",
  "frontend/src/components/ProtectedSection.tsx": "Wrapper component that renders children only if the current user's role is in the provided allowedRoles list, otherwise renders a fallback.",
  "frontend/src/components/RoleBadge.tsx": "Renders a styled badge displaying a user's role label with size and color variants derived from utility helpers.",
  "frontend/src/components/WaitingForApproval.tsx": "Full-screen placeholder shown to users whose accounts are pending admin approval, with a logout button.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, approvals, posts, comments, events, notifications, and roles.",
  "frontend/src/index.css": "Defines global CSS custom properties for the AnthroVerse purple-themed design system (light and dark modes) and imports Tailwind directives along with Google Fonts.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging, role/category label formatting, timestamp display, initials extraction, and permission checks.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabs for managing user approvals, role assignments, and tenure, restricted by role-based permission checks.",
  "frontend/src/pages/AuthPage.tsx": "Renders either the LoginPage or SignupForm based on local view state, toggling between login and signup views with a styled card layout.",
  "frontend/src/pages/ChapterGrowthPage.tsx": "Displays chapter growth analytics (total posts, user's posts, announcement count) and recent activity, restricted to users with the appropriate role permission.",
  "frontend/src/pages/EventsPage.tsx": "Lists community events with support for creating, approving, and registering for events; includes a banner image upload and role-based access for creation and approval.",
  "frontend/src/pages/FeedPage.tsx": "Community feed page supporting post creation with image upload, category filtering, likes, comments, and role-based moderation actions (approve/delete).",
  "frontend/src/pages/LoginPage.tsx": "Full-screen login page that authenticates users via Internet Identity, showing a branded card with a login button and loading state.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page allowing viewing and editing of name/email, uploading a profile picture, and displaying the user's role and principal ID.",
  "frontend/src/pages/ProfileSetupPage.tsx": "A profile setup form page that collects a user's name, email, and optional profile picture, then saves the profile and navigates to the home route on success.",
  "frontend/src/pages/WaitingApprovalPage.tsx": "A page shown to users whose accounts are pending admin approval, offering buttons to request approval, refresh status, or log out.",
  "frontend/src/utils/permissions.ts": "Utility functions for role-based permission checks, including display name/badge helpers and predicates for actions like creating posts, approving content, and admin access.",
  "frontend/src/utils/time.ts": "Utility functions for formatting nanosecond BigInt timestamps into relative time strings, human-readable dates, and converting Date objects back to nanoseconds.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, an extended OKLCH-based color palette, border radii, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Defines the full project state for AnthroVerse (v17), including architecture, role-based governance rules, UI design system, known bugs (Root Admin approval bypass, role display, blank page after splash), and a registry of all existing and planned features."
}