{
  "backend/main.mo": "Main Motoko actor for the AnthroVerse backend, defining all core data types (User, Post, Event, Notification, etc.) and integrating authorization, blob storage, and user approval mixins. Contains state maps for users, posts, comments, events, tenures, notifications, and event registrations.",
  "feature_evidence.json": "Feature evidence report describing two high-confidence features related to fixing the root admin blank page bug in App.tsx for the email 'graph.dust@gmail.com', specifying guard clauses, fallback user object synthesis, and structural isolation from the isApproved gate.",
  "frontend-file-summaries.txt": "A JSON document summarizing each frontend source file's purpose and key changes, serving as a build planning reference for all pages, components, hooks, and utilities in the frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom properties for the light and dark theme color tokens (background, foreground, primary, sidebar, chart colors, etc.) used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the AnthroVerse React SPA, setting the page title and mounting the app into a root div via the main.tsx module script.",
  "frontend/src/App.tsx": "Root React app component that handles authentication state, profile/approval query loading, root admin bypass logic (including fallback user synthesis), and renders the TanStack Router-based layout with sidebar, header, and page routes.",
  "frontend/src/components/admin/RoleAssignmentPanel.tsx": "Admin panel for listing users by approval status (pending/approved/rejected), approving or rejecting them, and assigning roles via a dropdown.",
  "frontend/src/components/admin/TenureManagement.tsx": "Admin component for starting a new organizational tenure by selecting officers (President, VP, Secretary-Treasurer) from approved users and a semester period, then submitting via a multi-step dialog.",
  "frontend/src/components/AppHeader.tsx": "Sticky app header component featuring a sidebar toggle button and a notification bell dropdown that displays unread notifications with type labels and relative timestamps, marking them read on open.",
  "frontend/src/components/AppSidebar.tsx": "Renders the application sidebar with navigation links, user profile info, role badge, and logout button, using role-based logic to show admin-only items.",
  "frontend/src/components/auth/AuthLayout.tsx": "Layout wrapper for authentication pages that renders a full-screen background image, overlay, logo, and a card container for child content.",
  "frontend/src/components/auth/LoginForm.tsx": "Login form component that triggers Internet Identity authentication and provides a link to switch to the signup flow.",
  "frontend/src/components/auth/SignupForm.tsx": "Multi-step signup form that connects via Internet Identity and then collects a user's name, email, and optional profile picture to create their profile.",
  "frontend/src/components/auth/WaitingForApproval.tsx": "Screen shown to users whose accounts are pending admin approval, allowing them to send an approval request notification or log out.",
  "frontend/src/components/chapter-growth/GroupFeed.tsx": "Displays a filtered post feed for a specific category/group with a toggle to show a post creation form, loading skeletons, and an empty state.",
  "frontend/src/components/ErrorBoundary.tsx": "React class-based error boundary that catches runtime errors and displays a fallback UI with an optional error message in development mode.",
  "frontend/src/components/events/CreateEventForm.tsx": "Form component for creating a new event with fields for title, description, date/time, optional banner image upload, and an optional registration limit.",
  "frontend/src/components/events/EventCard.tsx": "Displays a single event card with banner image, date, registration limit, and a register button that calls the registration mutation and shows toast feedback.",
  "frontend/src/components/feed/CreatePostForm.tsx": "Form component for creating a new post with text content, category selection (filtered by user role), and optional image upload.",
  "frontend/src/components/feed/PendingApprovals.tsx": "Lists all posts with pending status and provides an approve button for each, intended for moderator/admin use.",
  "frontend/src/components/feed/PostCard.tsx": "Renders a single post with like/delete/approve actions, collapsible comments section, and category badge styling based on post type.",
  "frontend/src/components/feed/PostFilters.tsx": "Filter bar for the feed with category tab buttons, a 'My Posts' toggle, and a search input for filtering by member name.",
  "frontend/src/components/layout/MainLayout.tsx": "Main app shell with a sticky header, role-based navigation links, user profile link, and logout functionality.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple animated spinner component with configurable size (sm/md/lg) using Tailwind CSS.",
  "frontend/src/components/notifications/NotificationBell.tsx": "Bell icon button showing unread notification count that opens a popover panel and marks notifications as read on open.",
  "frontend/src/components/notifications/NotificationItem.tsx": "Renders a single notification row with a type-specific icon, message text, relative timestamp, and an unread indicator dot.",
  "frontend/src/components/notifications/NotificationPanel.tsx": "Renders a sorted list of notifications in a scrollable panel, or an empty state with a bell icon if there are none.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with like, comment, approve, and delete actions, with visibility of controls based on user role and authorship.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for new users to enter their name and email to create an initial profile, invalidating relevant queries on success.",
  "frontend/src/components/ProtectedSection.tsx": "Wrapper component that conditionally renders children only if the current user's role matches one of the allowed roles.",
  "frontend/src/components/RoleBadge.tsx": "Displays a styled badge for a user's role, with special handling for root admin display and configurable size.",
  "frontend/src/components/WaitingForApproval.tsx": "Full-screen placeholder shown to users whose accounts are pending admin approval, with a logout button.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including user profiles, approval management, posts, comments, events, and notifications.",
  "frontend/src/index.css": "Defines global CSS with Tailwind directives, custom OKLCH design tokens for light/dark themes (purple/gold/teal palette), and utility classes for glass effects and typography.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging, role/category label formatting, timestamp display, initials extraction, and permission checks.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabs for managing user approvals (approve/reject) and assigning roles, gated by permission checks on the caller's profile.",
  "frontend/src/pages/AuthPage.tsx": "Renders either the LoginPage or SignupForm based on local view state, toggling between login and signup views with a styled card layout.",
  "frontend/src/pages/ChapterGrowthPage.tsx": "Displays chapter growth analytics (total posts, user's posts, announcements count) and recent activity, restricted to users with the appropriate role permission.",
  "frontend/src/pages/EventsPage.tsx": "Lists community events with support for creating, approving, and registering for events; includes a banner image upload and role-based access controls.",
  "frontend/src/pages/FeedPage.tsx": "Renders the main community post feed with category filtering, post creation with image upload, like/delete/approve actions, and an inline comment section per post.",
  "frontend/src/pages/LoginPage.tsx": "Displays the Internet Identity login screen with a branded background, logo, and a login button that triggers the authentication flow.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the authenticated user's profile with avatar upload, editable name/email fields, role badge, and principal ID display.",
  "frontend/src/pages/ProfileSetupPage.tsx": "A profile setup form page that collects a user's name, email, and optional profile picture, then saves the profile and navigates to the home route on success.",
  "frontend/src/pages/WaitingApprovalPage.tsx": "A page shown to users whose accounts are pending admin approval, offering buttons to request approval, refresh status, or log out.",
  "frontend/src/utils/permissions.ts": "Utility functions for role-based permission checks, including display name/badge helpers and functions to determine if a user can create, approve, or delete posts based on their Role enum value.",
  "frontend/src/utils/time.ts": "Utility functions for formatting BigInt nanosecond timestamps into relative time strings, human-readable dates, and converting Date objects back to nanoseconds.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom fonts (Inter, Poppins), an extended OKLCH-based color palette, and includes the typography, container-queries, and animate plugins.",
  "project_state.json": "Defines the full project state for AnthroVerse, a Flutter/Firebase members-only app, including architecture, role hierarchy, permissions, UI design system, known issues (Root Admin approval/display bugs), and a list of all implemented and planned features."
}