{
  "backend/main.mo": "Main Motoko actor for AnthroVerse backend defining all data types (User, Post, Event, Tenure, etc.) and integrating access control, blob storage, and user approval mixins. Contains the full application logic including posts, events, notifications, registrations, and role-based authorization.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to their implementing frontend files, component dependencies, and test IDs for the AnthroVerse React frontend build.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each file's purpose, key fixes, and notable implementation details for the AnthroVerse frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes including colors, radius, sidebar, and chart variables.",
  "frontend/index.html": "Minimal HTML shell for the AnthroVerse Vite/React app, mounting the React root into a div and loading the main TSX entry point.",
  "frontend/src/App.tsx": "Root React component that manages phase-based app loading (initializing, unauthenticated, profile setup, waiting approval, main app) using Internet Identity and user profile state, with a TanStack Router instance for the main authenticated routes.",
  "frontend/src/components/admin/RoleAssignmentPanel.tsx": "Admin panel that lists approved users and allows assigning roles to them via a dropdown and confirm button.",
  "frontend/src/components/admin/TenureManagement.tsx": "Admin component that provides a multi-step dialog for starting a new organizational tenure, allowing selection of president, vice president, and secretary-treasurer from approved users along with a tenure period (Apr-Sep or Oct-Mar).",
  "frontend/src/components/AppHeader.tsx": "Sticky app header component with a sidebar toggle, mobile logo, and a notification bell dropdown that fetches and marks notifications read, displaying them with type labels and relative timestamps.",
  "frontend/src/components/AppSidebar.tsx": "Renders the application sidebar with navigation links, user profile info, role badge, and logout button, conditionally showing an admin section based on the user's role.",
  "frontend/src/components/auth/AuthLayout.tsx": "Layout wrapper for authentication pages that renders a full-screen background image with overlay, a centered logo/branding header, and a frosted-glass card container for child content.",
  "frontend/src/components/auth/LoginForm.tsx": "Login form component that triggers Internet Identity authentication via a single button, showing a loading state during login and a link to switch to the signup flow.",
  "frontend/src/components/auth/SignupForm.tsx": "Two-step signup form that first connects via Internet Identity, then collects name, email, and optional profile picture to create and save a new member profile.",
  "frontend/src/components/auth/WaitingForApproval.tsx": "Screen shown to users whose accounts are pending admin approval, offering a button to send an approval request notification and an option to sign out.",
  "frontend/src/components/chapter-growth/GroupFeed.tsx": "Feed component for a private group that displays posts filtered by category, supports creating new posts inline, and provides like, approve, and delete actions based on the caller's role.",
  "frontend/src/components/ErrorBoundary.tsx": "React class component that catches rendering errors and displays a fallback UI with an error message and a page refresh button.",
  "frontend/src/components/events/CreateEventForm.tsx": "Form component for creating a new event with fields for title, description, date/time, optional banner image upload, and an optional registration limit.",
  "frontend/src/components/events/EventCard.tsx": "Displays a single event card with banner, date, registration limit, and a register button that calls the registration mutation and shows toast feedback. Marks already-registered or past events accordingly.",
  "frontend/src/components/feed/CreatePostForm.tsx": "Form component for creating a new post with text content, category selection (filtered by user role), and optional image upload. Submits via the useSubmitPost mutation and resets state on success.",
  "frontend/src/components/feed/PendingApprovals.tsx": "Lists all posts with pending status and provides an approve button for each, using useGetPosts and useApprovePost hooks. Shows empty and loading states.",
  "frontend/src/components/feed/PostCard.tsx": "Renders a full post card with author info, category badge, like/comment/delete/approve actions, and an expandable comments section with add/delete comment support.",
  "frontend/src/components/feed/PostFilters.tsx": "Provides category tab filters, a 'My Posts' toggle, and a search-by-name input for filtering the post feed. Purely presentational with callback props.",
  "frontend/src/components/layout/MainLayout.tsx": "Main app shell with a sticky header (logo, admin link, notification bell), desktop tab navigation, mobile bottom navigation, and a centered content area.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple animated spinner component with configurable size (sm/md/lg) using Tailwind CSS.",
  "frontend/src/components/MainRouter.tsx": "Empty file with no content.",
  "frontend/src/components/notifications/NotificationBell.tsx": "Bell icon button showing an unread count badge; opens a NotificationPanel overlay and marks notifications as read on open.",
  "frontend/src/components/notifications/NotificationItem.tsx": "Renders a single notification row with a type-specific icon, message, timestamp, and an unread indicator dot.",
  "frontend/src/components/notifications/NotificationPanel.tsx": "Renders a dropdown panel displaying a sorted list of notifications using NotificationItem components, or an empty state with a bell icon if there are none.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with author info, category, like/comment interactions, and admin actions (approve, delete) based on user role and ownership.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for new users to enter their name and email to create a profile, with special handling for root admin email detection.",
  "frontend/src/components/ProtectedSection.tsx": "Wrapper component that conditionally renders children only if the current user's role matches one of the allowed roles.",
  "frontend/src/components/RoleBadge.tsx": "Small presentational component that renders a styled badge displaying a user's role label.",
  "frontend/src/components/WaitingForApproval.tsx": "Screen shown to users pending admin approval, offering buttons to request approval or log out.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the ICP backend actor, covering user profiles, posts, events, registrations, notifications, roles, and approvals.",
  "frontend/src/index.css": "Defines global CSS custom properties, Tailwind base/component/utility layers, and design tokens (colors, fonts, gradients) for the application's theme.",
  "frontend/src/lib/utils.ts": "Exports utility functions for class merging, role/category/status label formatting, timestamp formatting, initials generation, and role-based permission checks.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that allows authorized users to view and manage pending/approved user registrations, assign roles, and access tenure management, with root admin bypass logic.",
  "frontend/src/pages/AuthPage.tsx": "Renders either a login or signup view based on state, wrapping LoginPage and SignupForm components with a toggle between the two.",
  "frontend/src/pages/ChapterGrowthPage.tsx": "Displays chapter growth analytics (total posts, user's posts, announcements count) and recent activity, restricted to users with the appropriate role.",
  "frontend/src/pages/ChapterMeetingPage.tsx": "Shows chapter meeting details (date, time, venue, theme, etc.) and allows executive-role users to edit and save those details via a local form.",
  "frontend/src/pages/EventsPage.tsx": "Full events management page supporting creating, approving, registering for, and tracking payment status of chapter events, with role-based access controls.",
  "frontend/src/pages/FeedPage.tsx": "Community feed page that displays, filters, creates, approves, deletes, and likes posts, with a pinned announcements section and role-based posting permissions.",
  "frontend/src/pages/LoginPage.tsx": "Login screen with a background image and Internet Identity authentication button, showing a loading state while the login is in progress.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and allows editing of the authenticated user's profile, including name, email, profile picture upload, and principal ID display.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Onboarding form for new users to set their name, email, and optional profile picture before entering the app.",
  "frontend/src/pages/WaitingApprovalPage.tsx": "Shown to users whose accounts are pending admin approval, with options to request approval, refresh status, or log out.",
  "frontend/src/utils/permissions.ts": "Exports role-based permission helper functions (e.g., canApproveContent, canManageUsers) that check if a given Role has access to specific features.",
  "frontend/src/utils/time.ts": "Provides utility functions for formatting BigInt nanosecond timestamps into relative time strings, dates, and datetimes, plus conversion helpers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH-based color palette, typography fonts, border radii, shadows, and animations for the frontend.",
  "project_state.json": "Defines the AnthroVerse project state including architecture notes, design system tokens, Firestore collections, known issues, and a registry of all existing and planned features with their requirement IDs and versions."
}