{
  "backend/main.mo": "Main Motoko actor defining all core data types (User, Post, Event, Notification, etc.) and state maps for a community platform, with authorization, blob storage, and user approval mixins included.",
  "feature_evidence.json": "Feature evidence report declaring a retry deployment with no code changes, listing the affected frontend files and component dependencies for the build.",
  "frontend-file-summaries.txt": "JSON document summarizing key frontend page and component files, noting that pages were refactored to be self-contained by fetching props internally via hooks for TanStack Router compatibility.",
  "frontend/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "HTML entry point for the AnthroVerse frontend app, mounting the React app at the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that manages authentication state, renders a profile setup modal for new users, and defines the TanStack Router layout with sidebar and all page routes.",
  "frontend/src/components/admin/RoleAssignmentPanel.tsx": "Admin panel for managing user approvals and role assignments, displaying pending, approved, and rejected users with actions to approve, reject, or assign roles.",
  "frontend/src/components/admin/TenureManagement.tsx": "Admin dialog for starting a new organizational tenure by selecting officers (president, VP, secretary-treasurer) and a tenure period, with a warning that all elevated roles will be reset.",
  "frontend/src/components/AppHeader.tsx": "Sticky app header component displaying a sidebar toggle and a notification bell dropdown that fetches, displays, and marks notifications as read.",
  "frontend/src/components/AppSidebar.tsx": "Sidebar navigation component that renders nav links based on user role/admin status, displays the user's profile avatar and role badge, and handles logout.",
  "frontend/src/components/auth/AuthLayout.tsx": "Provides the full-screen authentication page layout with a background image, overlay, logo, and a card container for auth form children.",
  "frontend/src/components/auth/LoginForm.tsx": "Login form that triggers Internet Identity authentication with a single button, showing a loading state and a link to switch to the signup form.",
  "frontend/src/components/auth/SignupForm.tsx": "Multi-step signup form that first connects an Internet Identity, then collects name, email, and a required profile photo before saving the user profile and uploading the picture.",
  "frontend/src/components/auth/WaitingForApproval.tsx": "Displays a 'Pending Approval' screen for users awaiting admin approval, with options to send an approval request or sign out.",
  "frontend/src/components/chapter-growth/GroupFeed.tsx": "Renders a private group feed filtered by post category, with support for creating new posts and loading/empty states.",
  "frontend/src/components/events/CreateEventForm.tsx": "A dialog form for creating new events with title, description, date, registration limit, and optional banner image upload with progress tracking.",
  "frontend/src/components/events/EventCard.tsx": "Displays an event card with banner, details, and a registration button that tracks upcoming vs. past status and existing registration state.",
  "frontend/src/components/feed/CreatePostForm.tsx": "A form component for submitting new posts with category selection, text content, and optional image upload; supports announcement category for privileged roles.",
  "frontend/src/components/feed/PendingApprovals.tsx": "Fetches all posts and renders only those with pending status as a labeled section with a count badge.",
  "frontend/src/components/feed/PostCard.tsx": "Renders a single post with like, comment, delete, and approve actions, with role-based permission checks and lazy-loaded comments on expand.",
  "frontend/src/components/feed/PostFilters.tsx": "Renders post filtering UI with category tab buttons, a 'My Posts' toggle, and a search input for filtering by member name.",
  "frontend/src/components/layout/MainLayout.tsx": "Provides the main app shell with a sticky header, responsive navigation links (including role-gated routes), theme toggle, notification bell, and user avatar/logout controls.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple reusable animated loading spinner component with configurable size variants.",
  "frontend/src/components/notifications/NotificationBell.tsx": "Bell icon button that shows an unread count badge and opens a popover with the NotificationPanel, marking notifications as read on open.",
  "frontend/src/components/notifications/NotificationItem.tsx": "Renders a single notification row with a type-specific icon, message text, relative timestamp, and an unread indicator dot.",
  "frontend/src/components/notifications/NotificationPanel.tsx": "Displays a scrollable list of sorted NotificationItem rows inside a popover panel, or an empty state when there are no notifications.",
  "frontend/src/components/PostCard.tsx": "Renders a single post card with like, comment, delete, and approve actions, using role-based visibility for admin/author controls and a dropdown menu for post management.",
  "frontend/src/components/ProtectedSection.tsx": "A wrapper component that conditionally renders children only if the current user's role matches one of the allowed roles, otherwise rendering a fallback.",
  "frontend/src/components/RoleBadge.tsx": "Displays a styled badge for a user's role, with special handling for root admin display and configurable size.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated (or anonymous) ICP backend actor via React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity auth context with login/logout helpers, delegation validation, and status flags, exposed via the useInternetIdentity hook and InternetIdentityProvider component.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the app's backend actor, covering user profiles, posts, events, notifications, comments, and admin operations.",
  "frontend/src/index.css": "Global stylesheet that imports Poppins and Inter fonts, sets up Tailwind CSS, and defines CSS custom properties for the AnthroVerse purple-themed design system including light/dark mode color tokens, glass utilities, and role badge styles.",
  "frontend/src/lib/utils.ts": "Utility module providing helper functions for class merging (cn), role/category label formatting, timestamp formatting, permission checks by role, and post status badge styling.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabs for managing user approvals (approve/reject pending members) and assigning roles to users by principal, plus a tenure management section.",
  "frontend/src/pages/AuthPage.tsx": "Authentication page that toggles between LoginForm and SignupForm views within an AuthLayout wrapper.",
  "frontend/src/pages/ChapterGrowthPage.tsx": "Analytics page displaying chapter statistics (members, posts, events) with Recharts bar, line, and pie charts showing post activity over time, category distribution, and member approval status.",
  "frontend/src/pages/EventsPage.tsx": "Events page that lists upcoming and past events as cards with registration support, and provides a dialog form for authorized users to create new events with optional banner image upload.",
  "frontend/src/pages/FeedPage.tsx": "Main social feed page that displays posts with likes, comments, approval, and deletion functionality, supporting category filtering and role-based permissions for admin/LT users.",
  "frontend/src/pages/LoginPage.tsx": "Login page with a two-panel layout featuring Internet Identity authentication, displaying platform branding and feature highlights on the left and a sign-in button on the right.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing avatar, role badge, and tabbed views for posts and events, with dialogs for editing name/email and uploading a profile picture.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Onboarding form for new users to set their full name, email, and optional profile photo before completing registration.",
  "frontend/src/pages/WaitingApprovalPage.tsx": "Holding page shown to users pending admin approval, with buttons to request approval, refresh status, or log out.",
  "frontend/src/utils/permissions.ts": "Utility functions for role-based permission checks and display helpers, covering actions like posting announcements, managing users, and assigning roles based on the user's Role enum value.",
  "frontend/src/utils/time.ts": "Utility functions for formatting nanosecond BigInt timestamps into relative time strings, human-readable dates, and converting Date objects back to nanoseconds.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Inter, Poppins), an extended OKLCH-based color palette (primary, gold, teal, purple, sidebar, chart), border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing AnthroVerse, a Flutter/Firebase members-only app with role-based governance, approval workflows, and a Purple Edition design system, including architectural notes, known issues, and a versioned list of implemented features."
}