{
  "backend/main.mo": "Main Motoko actor defining all data types (User, Post, Event, Notification, etc.) and backend logic for an AnthroVerse community platform, including authorization, blob storage, user approval, posts, events, tenures, and notifications.",
  "feature_evidence.json": "Feature evidence report linking the admin page approval flow fix (correct identity passing and UI state update) to its affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-sentence summaries of each frontend source file, describing what each page/component does and what bug it fixes.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a `#root` div and loading the TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up React Query, TanStack Router with all page routes, and orchestrates auth phases (initializing, unauthenticated, profile setup, awaiting approval, main app).",
  "frontend/src/components/admin/RoleAssignmentPanel.tsx": "Admin panel component that lists approved non-root-admin users and allows assigning them a role from a dropdown, submitting the change via a mutation with loading and error feedback.",
  "frontend/src/components/admin/TenureManagement.tsx": "Admin dialog component for starting a new organizational tenure by selecting officers (President, VP, Secretary-Treasurer) from approved users and a tenure period, then invoking the startNewTenure mutation.",
  "frontend/src/components/AppHeader.tsx": "Sticky top header component with a sidebar toggle and a notification bell dropdown that fetches, displays, and marks notifications as read.",
  "frontend/src/components/AppSidebar.tsx": "Renders the collapsible application sidebar with navigation links (Feed, Events, Chapter Growth, Admin), user profile display, role badge, and logout functionality, with visibility gated by user role permissions.",
  "frontend/src/components/auth/AuthLayout.tsx": "Wrapper layout component for authentication pages that renders a full-screen background image with overlay, a centered logo, and a glassmorphism card containing child content.",
  "frontend/src/components/auth/LoginForm.tsx": "Login form component that triggers Internet Identity authentication via a single button and provides a link to switch to the signup flow.",
  "frontend/src/components/auth/SignupForm.tsx": "Multi-step signup form that first connects via Internet Identity, then collects name, email, and optional profile picture before saving the new user profile to the backend.",
  "frontend/src/components/auth/WaitingForApproval.tsx": "Full-screen holding page shown to users whose accounts are pending admin approval, offering a button to send an approval request and a sign-out option.",
  "frontend/src/components/chapter-growth/GroupFeed.tsx": "Feed component scoped to a specific PostCategory that lists posts with like/approve/delete actions, and includes an inline CreatePostForm toggle for creating new posts.",
  "frontend/src/components/ErrorBoundary.tsx": "React class component that catches rendering errors and displays a user-friendly error screen with a refresh button, showing error details in development mode.",
  "frontend/src/components/events/CreateEventForm.tsx": "Form component for creating a new event with fields for title, description, date/time, optional banner image upload, and an optional registration limit.",
  "frontend/src/components/events/EventCard.tsx": "Displays a single event card with banner, date, registration limit, and a register button that calls the registration mutation and shows toast feedback. Marks already-registered events with a checkmark and badges past vs. upcoming events.",
  "frontend/src/components/feed/CreatePostForm.tsx": "Form component for creating a new community post with text content, category selector (filtered by user role), and optional image attachment. Submits via the useSubmitPost mutation and resets state on success.",
  "frontend/src/components/feed/PendingApprovals.tsx": "Lists all posts with pending status and provides an approve button for each, using useGetPosts and useApprovePost hooks. Shows empty and loading states appropriately.",
  "frontend/src/components/feed/PostCard.tsx": "Renders a full post card with author info, category badge, like/comment/delete/approve actions, and an expandable comments section with add/delete comment support. Handles executive vs. author permission checks for moderation actions.",
  "frontend/src/components/feed/PostFilters.tsx": "Provides category tab filters, a 'My Posts' toggle, and a search-by-name input for filtering the post feed. Renders as a controlled component driven entirely by props and callbacks.",
  "frontend/src/components/layout/MainLayout.tsx": "Main authenticated layout wrapping the app with a sidebar, sticky header containing a notification bell with unread badge, and a user avatar dropdown menu with logout. Uses SidebarProvider and renders child routes via Outlet.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple animated spinner component with configurable size (sm/md/lg) using Tailwind CSS classes.",
  "frontend/src/components/MainRouter.tsx": "Empty file with no content.",
  "frontend/src/components/notifications/NotificationBell.tsx": "Bell icon button that toggles a NotificationPanel popover and marks notifications as read on open. Displays an unread count badge and closes the panel on outside click.",
  "frontend/src/components/notifications/NotificationItem.tsx": "Renders a single notification row with a type-specific icon, message text, formatted timestamp, and an unread indicator dot. Icon selection is driven by the notification's type variant.",
  "frontend/src/components/notifications/NotificationPanel.tsx": "Renders a dropdown panel displaying a sorted list of notifications using NotificationItem components, or an empty state with a bell icon if there are none.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with author info, category badge, like/comment interactions, and conditional admin actions (approve, delete) based on user role and ownership.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for new users to register a name and email after Internet Identity login, with special handling to detect and display a root admin indicator.",
  "frontend/src/components/ProtectedSection.tsx": "Wrapper component that conditionally renders children only if the current user's role is in the provided allowedRoles list, otherwise rendering an optional fallback.",
  "frontend/src/components/RoleBadge.tsx": "Small presentational component that renders a styled badge displaying a user's role label using utility functions for label and CSS class lookup.",
  "frontend/src/components/WaitingForApproval.tsx": "Screen shown to registered users whose accounts are pending admin approval, offering buttons to refresh the page or log out.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, covering user profiles, posts, comments, events, registrations, notifications, and admin operations with appropriate cache invalidation and toast feedback.",
  "frontend/src/index.css": "Defines global CSS custom properties, Tailwind base/component/utility layers, and custom design tokens (colors, gradients, badge styles, fonts) for the application's design system.",
  "frontend/src/lib/utils.ts": "Exports utility functions for class merging, role/category/status label formatting, timestamp display, permission checks, and initials generation used throughout the frontend.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that allows authorized executive users to approve/reject pending users and assign roles, with loading and permission-denied states handled.",
  "frontend/src/pages/AuthPage.tsx": "Renders either a login or signup view based on state, wrapping LoginPage and SignupForm components with toggling between them.",
  "frontend/src/pages/ChapterGrowthPage.tsx": "Displays chapter analytics (member counts, pending approvals, events, posts) and role distribution stats; restricted to LT members and above.",
  "frontend/src/pages/ChapterMeetingPage.tsx": "Shows upcoming approved events and an editable meeting notes section, with edit controls gated to executive roles.",
  "frontend/src/pages/EventsPage.tsx": "Full events management page supporting event listing, registration, approval (for executives), and a create-event form with tabbed pending/approved views.",
  "frontend/src/pages/FeedPage.tsx": "Community feed page with post creation, category/search filtering, like/approve/delete actions, and a pending approvals section for admins.",
  "frontend/src/pages/LoginPage.tsx": "Login screen with a background image and Internet Identity authentication button, showing a loading state while logging in.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and allows editing of the authenticated user's profile, including name, email, company, description, and profile picture with upload support.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Onboarding form for new users to set their name, email, and optional profile picture before being redirected to the home page.",
  "frontend/src/pages/WaitingApprovalPage.tsx": "Shown to users whose accounts are pending admin approval, with options to request approval, refresh status, or log out.",
  "frontend/src/utils/permissions.ts": "Defines role-based permission helper functions (e.g., canManageUsers, canApprovePost, canAccessAdmin) used throughout the frontend to gate UI features.",
  "frontend/src/utils/time.ts": "Provides utility functions for formatting BigInt nanosecond timestamps into human-readable relative times, dates, and datetimes.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with brand colors (purple, teal, gold), typography fonts, border radii, shadows, and animations.",
  "project_state.json": "Tracks project metadata, existing features, and pending fix requests, currently focused on resolving a backend authorization bug that prevents admins from approving members."
}