{
  "backend/main.mo": "Main actor for the AnthroVerse backend defining all data types (User, Post, Event, Tenure, etc.), state maps, and public API endpoints with role-based access control, blob storage, and user approval mixins.",
  "backend/migration.mo": "Data migration module that upgrades the stored User type by adding `companyName` and `description` fields (defaulting to empty strings) to all existing user records.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (admin panel, profile badges, role assignment, profile editing, etc.) to their corresponding frontend/backend files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-sentence summaries of each frontend source file, describing key fixes and responsibilities for pages, hooks, components, and utilities.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, sidebar, and chart variables.",
  "frontend/index.html": "Minimal HTML shell for the AnthroVerse SPA that mounts the React app into a `#root` div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up React Query, TanStack Router, and handles authentication phases (loading, unauthenticated, profile setup, awaiting approval, main app) before rendering the routed layout.",
  "frontend/src/components/admin/RoleAssignmentPanel.tsx": "Admin panel card that lists all approved (non-root-admin) users and allows an admin to select and assign roles to each user via a dropdown and confirm button.",
  "frontend/src/components/admin/TenureManagement.tsx": "Admin component for starting a new organizational tenure by selecting officers (president, vice president, secretary-treasurer) from approved users and assigning a semester period. Displays a multi-step dialog with a warning about role resets before submitting.",
  "frontend/src/components/AppHeader.tsx": "Sticky top header component with a sidebar toggle button and a notification bell dropdown that fetches, displays, and marks notifications as read.",
  "frontend/src/components/AppSidebar.tsx": "Renders the application sidebar with navigation links (Feed, Events, Chapter Growth), user profile display, role badge, and logout functionality, conditionally showing items based on user role and admin status.",
  "frontend/src/components/auth/AuthLayout.tsx": "Wrapper layout component for authentication pages that renders a full-screen background image with overlay, a centered logo/branding header, and a frosted-glass card container for child content.",
  "frontend/src/components/auth/LoginForm.tsx": "Login form component that triggers Internet Identity authentication via a single button, showing a loading state during login and a link to switch to the signup flow.",
  "frontend/src/components/auth/SignupForm.tsx": "Two-step signup form that first connects via Internet Identity, then collects name, email, and optional profile picture to create and save a new user profile.",
  "frontend/src/components/auth/WaitingForApproval.tsx": "Full-screen holding page shown to users whose accounts are pending admin approval, with a button to send an approval request and an option to sign out.",
  "frontend/src/components/chapter-growth/GroupFeed.tsx": "Feed component for a specific post category/group that lists posts with like, approve, and delete actions, and includes a toggleable inline post creation form.",
  "frontend/src/components/ErrorBoundary.tsx": "React class component that catches runtime errors and displays a user-friendly error screen with a refresh button, showing error details in development mode.",
  "frontend/src/components/events/CreateEventForm.tsx": "Form component for creating a new event with fields for title, description, date/time, optional banner image upload, and an optional registration limit.",
  "frontend/src/components/events/EventCard.tsx": "Displays a single event card with banner, date, registration limit, and a register button that calls the registration mutation and shows toast feedback. Marks already-registered or past events accordingly.",
  "frontend/src/components/feed/CreatePostForm.tsx": "Form component for creating a new post with content, category selection (filtered by user role), and optional image upload. Submits via the useSubmitPost mutation and resets state on success.",
  "frontend/src/components/feed/PendingApprovals.tsx": "Lists all posts with pending status and provides an approve button for each, using the useApprovePost mutation. Shows a loading spinner or empty state when appropriate.",
  "frontend/src/components/feed/PostCard.tsx": "Renders a full post card with author info, category badge, like/comment/delete/approve actions, and an expandable comments section with add/delete comment support.",
  "frontend/src/components/feed/PostFilters.tsx": "Provides category tab filters, a 'My Posts' toggle, and a search input for filtering the post feed by category or author name.",
  "frontend/src/components/layout/MainLayout.tsx": "Main authenticated layout wrapping all pages with a sidebar, sticky header containing role-based navigation buttons, a notification bell with unread count, and a user dropdown menu with logout.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple animated spinner component with configurable size (sm/md/lg) used as a loading indicator throughout the app.",
  "frontend/src/components/MainRouter.tsx": "Empty file with no content.",
  "frontend/src/components/notifications/NotificationBell.tsx": "Bell icon button that shows an unread count badge and toggles a NotificationPanel dropdown, marking notifications as read when opened.",
  "frontend/src/components/notifications/NotificationItem.tsx": "Renders a single notification row with a type-specific icon, message text, formatted timestamp, and an unread indicator dot.",
  "frontend/src/components/notifications/NotificationPanel.tsx": "Renders a dropdown panel displaying a sorted list of notifications using NotificationItem components, or an empty state with a bell icon if there are none.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with author info, category, like/comment interactions, and conditional admin actions (approve, delete) based on user role and ownership.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for new users to register a name and email after Internet Identity login, with special handling to detect and display a root admin account notice.",
  "frontend/src/components/ProtectedSection.tsx": "Wrapper component that conditionally renders children only if the current user's role is in the provided allowedRoles list, otherwise rendering an optional fallback.",
  "frontend/src/components/RoleBadge.tsx": "Small presentational component that renders a styled badge displaying a user's role label using utility functions for label and CSS class lookup.",
  "frontend/src/components/WaitingForApproval.tsx": "Screen shown to registered users whose accounts are pending admin approval, offering options to recheck status or log out.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the backend actor, covering user profiles, posts, events, comments, registrations, notifications, and admin operations.",
  "frontend/src/index.css": "Global stylesheet that imports Poppins and Inter fonts, defines CSS custom properties for the design system, and declares Tailwind base, component, and utility layers including badges, gradients, and glass-card styles.",
  "frontend/src/lib/utils.ts": "Utility module exporting helper functions for class merging, role/category label formatting, badge styling, timestamp formatting, initials extraction, and role-based permission checks.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabs for managing user approvals, role assignments, and content, using mutations to approve/reject users and assign roles.",
  "frontend/src/pages/AuthPage.tsx": "Renders either the LoginPage or a signup form based on local view state, toggling between the two with a button. Accepts an optional `showSignup` prop to default to the signup view.",
  "frontend/src/pages/ChapterGrowthPage.tsx": "Displays chapter growth analytics (total posts, user's posts, announcement count) and recent activity, restricted to users with the appropriate role via `canAccessChapterGrowth`.",
  "frontend/src/pages/ChapterMeetingPage.tsx": "Shows chapter meeting details (date, time, venue, theme, etc.) and allows executive-role users to edit and save those details via a local form with toast feedback.",
  "frontend/src/pages/EventsPage.tsx": "Full events management page supporting creating, approving, registering for, and toggling payment status on events, with role-based access control for executives vs. regular members.",
  "frontend/src/pages/FeedPage.tsx": "Community feed page with category filtering, post creation, approval of pending posts, deletion, and like toggling, with a pinned announcements section and role-based permissions.",
  "frontend/src/pages/LoginPage.tsx": "Login screen that authenticates users via Internet Identity, displaying a branded card with a logo, description, and a login button that shows a spinner while connecting.",
  "frontend/src/pages/ProfilePage.tsx": "A profile page component that displays and allows editing of a user's profile information (name, email, company, description, profile picture), with support for image upload progress and role-based display.",
  "frontend/src/pages/ProfileSetupPage.tsx": "An initial profile setup form for new users to enter their name, email, and optional profile picture before being navigated to the home page.",
  "frontend/src/pages/WaitingApprovalPage.tsx": "A holding page shown to users whose accounts are pending admin approval, offering options to request approval, refresh status, or log out.",
  "frontend/src/utils/permissions.ts": "Defines role-based permission helper functions (e.g., canApproveContent, canManageUsers, canCreatePost) used throughout the app to gate features by user role.",
  "frontend/src/utils/time.ts": "Utility functions for formatting BigInt nanosecond timestamps into human-readable relative time, dates, and datetimes, plus helpers for checking if a time is upcoming and converting dates to nanoseconds.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH/HSL color tokens, typography fonts (Poppins, Inter), border radii, box shadows, and fade/slide animations.",
  "project_state.json": "Tracks the current state of a web app project at version 3, listing known issues, existing features, and architectural notes focused on admin account visibility, profile editing, role management, and logout functionality."
}