{
  "kind": "build_request",
  "title": "Fix blank page for Root Admin (graph.dust@gmail.com) after loading screen",
  "projectName": "AnthroVerse",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "In App.tsx, audit the Root Admin bypass code path specifically for the email 'graph.dust@gmail.com'. The blank page occurs only for this account while other accounts render correctly, indicating the root admin conditional branch either throws an unhandled error, enters an infinite loading state, or renders null/undefined. Trace the execution path after the root admin email check: ensure the user profile query result is confirmed non-null before any property access, that the root admin branch does not depend on isApproved being true before proceeding, and that no missing or undefined variable causes a silent crash. Add console logging or guard clauses to ensure this path always resolves to rendering the main app layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "It is opening for other accounts but blank page for graph.dust@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "Logging in with graph.dust@gmail.com successfully renders the main app layout without a blank page",
        "The root admin bypass path does not throw any unhandled errors or enter an infinite loading state",
        "All other accounts continue to work as before",
        "If the user profile query returns null or undefined for the root admin, the app does not crash — it waits or constructs a fallback profile"
      ]
    },
    {
      "id": "REQ-31",
      "text": "In App.tsx, ensure that the root admin bypass check for 'graph.dust@gmail.com' is structurally isolated from the isApproved gate and the profile-null guard. Specifically: (1) evaluate the email check against the identity/profile only after the profile query has settled (not during loading), (2) if the profile query returns null/undefined for the root admin, synthesize a minimal fallback user object with role = #rootAdmin and isApproved = true so the render path is never blocked, (3) never allow the root admin code path to fall through to the WaitingForApproval or ProfileSetup branches.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "It is opening for other accounts but blank page for graph.dust@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "graph.dust@gmail.com never sees the WaitingForApproval screen",
        "graph.dust@gmail.com never sees the ProfileSetup screen unless explicitly navigating there",
        "If the backend profile query fails or returns null for the root admin, a fallback profile object is used and the main layout renders",
        "The root admin bypass check only runs after the auth and profile loading phase is complete, not during it"
      ]
    },
    {
      "id": "REQ-32",
      "text": "In the backend (main.mo), add a guard at the entry point of getMyProfile (and any equivalent profile-fetch function) so that if the caller's email is exactly 'graph.dust@gmail.com' and their record is missing or has isApproved = false or role != #rootAdmin, the record is created or updated to isApproved = true and role = #rootAdmin before returning. This ensures the frontend never receives a null, unapproved, or low-privilege profile for the root admin on any query.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "It is opening for other accounts but blank page for graph.dust@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "getMyProfile called by graph.dust@gmail.com always returns a record with isApproved = true and role = #rootAdmin",
        "If no record exists for graph.dust@gmail.com, it is auto-created with the correct values",
        "No other user's profile is affected by this change"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/ or frontend/src/components/ui",
    "The fix must not regress the working behavior for all other user accounts",
    "Root Admin identity must be determined solely by the email value 'graph.dust@gmail.com'"
  ],
  "nonGoals": [
    "Redesigning the authentication flow for non-root-admin users",
    "Adding new features or permissions beyond fixing the blank page rendering issue",
    "Changing the visual design or theme"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}