{
  "kind": "build_request",
  "title": "Fix registration flow and admin member removal",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the registration flow so that newly registered users are immediately granted access to the main app without any approval gate or waiting screen. After completing profile setup, users must be routed directly to the main application.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "no. not working."
        ]
      },
      "acceptanceCriteria": [
        "A new user who completes the signup and profile setup flow is immediately taken to the main app",
        "No approval waiting screen or gate is shown after registration",
        "The user's status in the backend is set to approved upon registration",
        "Refreshing the page after registration does not redirect the user back to a waiting or approval screen"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the admin member removal feature so that admins can successfully remove members from the Members tab in the Admin panel. The remove action must call the correct backend function, handle errors gracefully, and reflect the updated member list immediately after removal.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "no. not working."
        ]
      },
      "acceptanceCriteria": [
        "A 'Remove Member' action is visible and functional in the admin Members tab for eligible users",
        "Clicking remove triggers a confirmation prompt before proceeding",
        "The backend successfully removes the user and returns a success result",
        "The member list updates immediately after a successful removal without requiring a full page reload",
        "An appropriate error message is shown if the removal fails"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Preserve existing role-based access control logic",
    "Keep all backend logic in the single main actor at backend/main.mo"
  ],
  "nonGoals": [
    "Redesigning the authentication UI or layout",
    "Adding new admin features beyond member removal",
    "Changing the existing approval flow for posts or events"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}