{
  "kind": "build_request",
  "title": "Fix member approval authorization bug",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the backend authorization logic so that admins/managers with the appropriate role can successfully approve pending members. The approve call must correctly identify the caller's principal and validate their permission to approve users without returning an authorization error.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "not able to approve",
          "Approving members is broken — authorization fix in progress"
        ]
      },
      "acceptanceCriteria": [
        "An admin or manager can call the approve user endpoint without receiving an authorization error",
        "The approved user's status transitions from pending to approved in the backend state",
        "Unauthorized principals (non-admin/non-manager roles) are still correctly rejected"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the frontend AdminPage pending-users approval flow so that when the approve button is clicked, the authenticated caller's identity is correctly passed to the backend actor and the UI reflects the updated approval state after success.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "not able to approve",
          "the frontend AdminPage pending-users approval flow correctly passes the authenticated caller's identity to the backend"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the approve button on a pending user in AdminPage triggers the backend call with the correct authenticated identity",
        "On success, the pending user is removed from the pending list and appears in the approved members list",
        "On failure, a clear error toast or message is shown to the admin"
      ]
    }
  ],
  "constraints": [
    "Do not change any immutable frontend paths (useInternetIdentity.ts, useActor.ts, main.tsx, ui components)",
    "Keep all backend logic within the single main actor in backend/main.mo"
  ],
  "nonGoals": [
    "Adding new user roles or permissions beyond what already exists",
    "Changing the overall approval workflow UI layout",
    "Fixing any other unrelated authorization flows"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}