{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix blank page for Root Admin (graph.dust@gmail.com) after loading screen",
  "requirements": [
    {
      "id": "REQ-30",
      "summary": "Audit and fix the Root Admin bypass code path in App.tsx to prevent blank page rendering for graph.dust@gmail.com",
      "acceptanceCriteria": [
        "Logging in with graph.dust@gmail.com successfully renders the main app layout without a blank page",
        "The root admin bypass path does not throw any unhandled errors or enter an infinite loading state",
        "All other accounts continue to work as before",
        "If the user profile query returns null or undefined for the root admin, the app does not crash — it waits or constructs a fallback profile"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Fix the root admin bypass logic for graph.dust@gmail.com: (1) Move the root admin email check to only execute after the profile query has completed (profileLoading is false and isFetched is true), not during loading. (2) Add explicit null/undefined guards before accessing userProfile.email to prevent silent crashes. (3) Add console logging to trace the root admin code path execution. (4) Ensure that when userProfile is null for the root admin email, the code waits for the profile query to settle rather than rendering a blank state. (5) Verify that the root admin path resolves to rendering <RouterProvider router={router} /> and never falls through to WaitingForApproval or ProfileSetup branches. (6) Add a guard clause that if identity.getPrincipal().toString() matches a known root admin principal (if available) or if the email check passes, bypass approval gates entirely."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Structurally isolate the root admin bypass from approval and profile-null guards in App.tsx",
      "acceptanceCriteria": [
        "graph.dust@gmail.com never sees the WaitingForApproval screen",
        "graph.dust@gmail.com never sees the ProfileSetup screen unless explicitly navigating there",
        "If the backend profile query fails or returns null for the root admin, a fallback profile object is used and the main layout renders",
        "The root admin bypass check only runs after the auth and profile loading phase is complete, not during it"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor the conditional rendering logic in App.tsx to structurally separate the root admin path: (1) After profileLoading is false and isFetched is true, check if userProfile?.email === 'graph.dust@gmail.com' OR if a hardcoded root admin principal matches the current identity. (2) If the root admin check passes but userProfile is null, synthesize a minimal fallback User object with { name: 'Root Admin', email: 'graph.dust@gmail.com', role: Role.rootAdmin, isApproved: true } and pass it to the router context or store it in local state. (3) Ensure the root admin code path skips both the isApproved check and the userProfile === null check that would trigger ProfileSetup. (4) The render flow should be: if (isRootAdmin) { render main app } else if (!isApproved) { render WaitingForApproval } else if (userProfile === null) { render ProfileSetup } else { render main app }. (5) Add inline comments documenting the root admin bypass logic for future maintainers."
        }
      ]
    }
  ]
}